[{
	"id": "candidats",
	"title": "Les Candidats 2017",
	"subtitle": "Candidates comparison for the French political elections",
	"img": "img/projects/candidats2017.jpg",
	"description": {
		"Description": [
			"Website about the french political elections in 2017. Based on user-defined priorities (environment, economy,  education, ...), it provides a personalized survey to find one's most appropriage candidate",
			"It also includes a comparison of candidates opinions on a broad range of topics, as well as the candidates biographies.",
			"The website was visited by more than ... unique users during the last two weeks of the election first round. Except from the technical part that was done on my own, the content and the information were gathered with <a href=''>Louise Hombert</a>."
		],
		"Technical details": [
			"The front-end has been designed thanks to Bootstrap to make the website responsive (...% of the user ), and, thanks to <a href='https://surveyjs.io/Overview/Library/'>SurveyJS</a> library that provide open source survey library. ",
			"The back-end has been built with nodeJS, communicating with a MongoDB database hosted on <a href='https://mlab.com/'>mlab</a>.",
			"The final project is open-source, hosted <a href='https://github.com/Symcies/LesCandidats'> here on Github</a>. No information were collected about the user - except for the website activity, thanks to Google Analytics."
		]
	},
	"link": "https://lescandidats2017.fr",
	"date": "First semester of 2017",
	"tags": [
		"Politics",
		"Personalized survey",
		"JavaScript",
		"Node & Express",
		"Bootstrap",
		"SurveyJS",
		"MongoDB"
	]
}, {
	"id": "bimbamjob",
	"title": "BimBamJob x Data For Good",
	"subtitle": "SMS Chatbot for job seekers",
	"img": "img/projects/bimbamjob.jpg",
	"description": {
		"Description": [
			"<a href='https://dataforgood.fr/'>Data For Good</a> is an association which aims to gather a community of data scientists, machine learners, developers, computer scientists, ... to address the technical challenges of social-oriented association and companies.",
			"On the other side, <a href='https://bimbamjob.fr/'>BimBamJob</a> is a company that facilitates job-seeking for low-qualified persons, that are not at ease with online job-offers nor the french language.",
			"To this end, BimBamJob reached out the DataForGood community. Our team of 4 data scientists & architects developped a SMS chatbot for job seekers. Based on the information they provide, the bot is able to create a curriculum vitae (personnal information, education, experiences, ...)",
			"A Proof of Concept has then been developped to match individual curriculum to different job offers.",
			"As this is the aim of the Data For Good community, the job has been done voluntarily - further details <a href='https://dataforgood.fr/projects/3_bimbamjob.html'>here</a>"
		],
		"Techical details": [
			"The service, which is hosted on Heroku, acts as an orchestrator that dialogs with the user and keeps track of the conversion progression. It send questions to an SMS provided that forward them directly on the user phone. The user answers are then analysed thanks to <a href='https://dialogflow.com/'> DialogFlow</a>, the Google API for Natural Language Processing, and specific details are stored on the user database.",
			"The conversation is also send to the BimBamJob back-end so that BimBamJob employes are able to intervene directly on the workflow, and substitute the Bot with no change for the end user.",
			"The users are then registered in the BimBamJob database, allowing personnalized job suggestions. Also, a website has been designed to allow users to get the final version of the Curriculum Vitae, and use it for personnal pursposes."
		]
	},
	"link": "https://bimbamjob.fr/",
	"date": "April 2017 -  December 2019",
	"tags": [
		"SMS ChatBot",
		"Social and Solidarity Economy",
		"Python",
		"DialogFlow - Google Api"
	]
}, {
	"id": "cashless",
	"title": "Cashless App",
	"subtitle": "Cashless application for the Double 9 Festival ",
	"img": "img/projects/festival.jpg",
	"description": {
		"Description": [
			"The Double 9 festival, for its third edition, decided to go cashless to avoid dealing large amounts of cash. As some friends were organizing the festival, two friends and I decided to build the cashless app voluntarily.",
			"The participants are given a card that is synchronized with their identity. They then can credit their card and spend it at different shops. The app is use by the organization to credit the personal cards by scanning them with a phone, or by the sellers than scan the card to withdraw the money",
			"The app development is still in progress as the festival is in June 2019 ; capacity and speed tests are under construction to handle the hundreds of participants at the festival"
		],
		"Techical details": [
			"To be revealed soon, in open source (Github, React Native, Firebase, Javascript, ...)"
		]
	},
	"link": "",
	"date": "",
	"tags": []
}, {
	"id": "summerschool",
	"title": "Data Science Summer School",
	"subtitle": "Teacher of Machine Learning in Healthcare",
	"img": "img/projects/summerschool.jpg",
	"description": {
		"Description": [
			"The faculty of applied science of the <a href='https://ucu.edu.ua/en/'>Ukrainian Catholic University</a>, in Lviv, organizes a yearly <a href='http://cs.ucu.edu.ua/en/summerschool/summer-school-2018/'>Data Science Summer School</a>. I have been invited as a lectured for the last two years.",
			"The course, called 'Machine Learning in Healthcare', goes througth the classic Machine Learning pipelines with particular focuses on medical application (longitudinal data, noisy labels, image segmentation, disease staging, ...). It corresponds to 5 classes, including practical sessions.",
			"The course is followed by a 4-day project (hackathon-style) that challenges students to diagnose and prognose the staging of Alzheimer's Disease patients."
		],
		"Details": [
			"PDF of the courses : <a href='/pdf/summerschool/1_Introduction.pdf''>Intro</a>, <a href='/pdf/summerschool/2_FeatureExtraction.pdf''>Feature Extraction</a>, <a href='/pdf/summerschool/3_Exploration.pdf''>Exploration</a>, <a href='/pdf/summerschool/4_Algorithms.pdf''>Algorithms</a>, <a href='/pdf/summerschool/5_Other.pdf''>Miscelleanous</a>.",
			"The practical sessions depends on a medical database that I do not wish to share publicly. Please contact me if interested."
		]
	},
	"link": "",
	"date": "",
	"tags": [
		"Machine Learning",
		"Healthcare",
		"Summer school",
		"Teaching",
		"Hackathon"
	]
}, {
	"id": "atlas",
	"title": "Grand Atlas du Cerveau",
	"subtitle": "Glénat x Le Monde x ICM",
	"img": "img/projects/atlaslemonde.jpg",
	"description": {
		"Description": [
			"The newspaper Le Monde, in collaboration with the editor Glénat, has collaborated with the <a href='https://icm-institute.org/fr/'>Brain and Spine Institute</a> were I work to publish the an <a href='https://boutique.lemonde.fr/atlas-du-cerveau.html'>'Grand Atlas du Cerveau'</a> (Large Atlas of the Brain).",
			"Our team has contributed to the Atlas and some of my work and visual representations are displayed in the book."
		]
	},
	"link": "",
	"date": "2018",
	"tags": [
		"Scientific communication",
		"Vulgarization",
		"Digital models",
		"Spatiotemporal models",
		"Disease progression"
	]
}]
